src/main/java/ok/dht/test/yasevich/profiling/stage5/wrk/get-report-2_1
Running 1m test @ http://localhost:12353
  8 threads and 64 connections
  Thread calibration: mean lat.: 883.172ms, rate sampling interval: 2099ms
  Thread calibration: mean lat.: 888.446ms, rate sampling interval: 2113ms
  Thread calibration: mean lat.: 878.260ms, rate sampling interval: 2058ms
  Thread calibration: mean lat.: 891.021ms, rate sampling interval: 2107ms
  Thread calibration: mean lat.: 887.401ms, rate sampling interval: 2101ms
  Thread calibration: mean lat.: 883.560ms, rate sampling interval: 2105ms
  Thread calibration: mean lat.: 907.900ms, rate sampling interval: 2160ms
  Thread calibration: mean lat.: 879.287ms, rate sampling interval: 2081ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.70s     1.44s    6.71s    60.68%
    Req/Sec     2.88k    99.67     3.15k    63.98%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.61s 
 75.000%    4.87s 
 90.000%    5.77s 
 99.000%    6.44s 
 99.900%    6.62s 
 99.990%    6.69s 
 99.999%    6.71s 
100.000%    6.72s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1030.655     0.000000            4         1.00
    1841.151     0.100000       115347         1.11
    2283.519     0.200000       230747         1.25
    2693.119     0.300000       345804         1.43
    3170.303     0.400000       461041         1.67
    3614.719     0.500000       576410         2.00
    3926.015     0.550000       634299         2.22
    4122.623     0.600000       691763         2.50
    4325.375     0.650000       750033         2.86
    4562.943     0.700000       806918         3.33
    4866.047     0.750000       864593         4.00
    5013.503     0.775000       894111         4.44
    5152.767     0.800000       922606         5.00
    5296.127     0.825000       950931         5.71
    5447.679     0.850000       980306         6.67
    5595.135     0.875000      1009008         8.00
    5677.055     0.887500      1023137         8.89
    5767.167     0.900000      1037982        10.00
    5861.375     0.912500      1052086        11.43
    5951.487     0.925000      1066591        13.33
    6033.407     0.937500      1080624        16.00
    6082.559     0.943750      1088347        17.78
    6123.519     0.950000      1095287        20.00
    6164.479     0.956250      1102772        22.86
    6205.439     0.962500      1109743        26.67
    6250.495     0.968750      1116621        32.00
    6275.071     0.971875      1120488        35.56
    6299.647     0.975000      1124296        40.00
    6320.127     0.978125      1127345        45.71
    6344.703     0.981250      1130933        53.33
    6377.471     0.984375      1134821        64.00
    6389.759     0.985938      1136367        71.11
    6406.143     0.987500      1138166        80.00
    6426.623     0.989062      1140190        91.43
    6443.007     0.990625      1141754       106.67
    6463.487     0.992188      1143660       128.00
    6475.775     0.992969      1144574       142.22
    6488.063     0.993750      1145585       160.00
    6500.351     0.994531      1146438       182.86
    6512.639     0.995313      1147225       213.33
    6529.023     0.996094      1148096       256.00
    6537.215     0.996484      1148517       284.44
    6549.503     0.996875      1149064       320.00
    6561.791     0.997266      1149584       365.71
    6569.983     0.997656      1149914       426.67
    6582.271     0.998047      1150343       512.00
    6590.463     0.998242      1150629       568.89
    6594.559     0.998437      1150733       640.00
    6606.847     0.998633      1151022       731.43
    6615.039     0.998828      1151253       853.33
    6623.231     0.999023      1151420      1024.00
    6631.423     0.999121      1151613      1137.78
    6635.519     0.999219      1151732      1280.00
    6639.615     0.999316      1151852      1462.86
    6639.615     0.999414      1151852      1706.67
    6647.807     0.999512      1151996      2048.00
    6651.903     0.999561      1152051      2275.56
    6655.999     0.999609      1152117      2560.00
    6660.095     0.999658      1152206      2925.71
    6660.095     0.999707      1152206      3413.33
    6664.191     0.999756      1152305      4096.00
    6664.191     0.999780      1152305      4551.11
    6664.191     0.999805      1152305      5120.00
    6668.287     0.999829      1152349      5851.43
    6672.383     0.999854      1152379      6826.67
    6676.479     0.999878      1152397      8192.00
    6680.575     0.999890      1152403      9102.22
    6688.767     0.999902      1152416     10240.00
    6701.055     0.999915      1152459     11702.86
    6701.055     0.999927      1152459     13653.33
    6701.055     0.999939      1152459     16384.00
    6705.151     0.999945      1152475     18204.44
    6705.151     0.999951      1152475     20480.00
    6709.247     0.999957      1152497     23405.71
    6709.247     0.999963      1152497     27306.67
    6709.247     0.999969      1152497     32768.00
    6709.247     0.999973      1152497     36408.89
    6713.343     0.999976      1152515     40960.00
    6713.343     0.999979      1152515     46811.43
    6713.343     0.999982      1152515     54613.33
    6713.343     0.999985      1152515     65536.00
    6713.343     0.999986      1152515     72817.78
    6713.343     0.999988      1152515     81920.00
    6713.343     0.999989      1152515     93622.86
    6717.439     0.999991      1152527    109226.67
    6717.439     1.000000      1152527          inf
#[Mean    =     3701.016, StdDeviation   =     1440.867]
#[Max     =     6713.344, Total count    =      1152527]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1381817 requests in 1.00m, 91.30MB read
  Non-2xx or 3xx responses: 685292
Requests/sec:  23030.51
Transfer/sec:      1.52MB