src/main/java/ok/dht/test/yasevich/profiling/stage5/wrk/get-report-3_2
Running 1m test @ http://localhost:12353
  8 threads and 64 connections
  Thread calibration: mean lat.: 18.735ms, rate sampling interval: 88ms
  Thread calibration: mean lat.: 18.596ms, rate sampling interval: 87ms
  Thread calibration: mean lat.: 19.352ms, rate sampling interval: 92ms
  Thread calibration: mean lat.: 19.040ms, rate sampling interval: 92ms
  Thread calibration: mean lat.: 21.382ms, rate sampling interval: 105ms
  Thread calibration: mean lat.: 20.920ms, rate sampling interval: 100ms
  Thread calibration: mean lat.: 20.211ms, rate sampling interval: 96ms
  Thread calibration: mean lat.: 20.767ms, rate sampling interval: 101ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.82s     1.21s    4.16s    54.30%
    Req/Sec     1.45k   228.67     2.11k    64.33%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.92s 
 75.000%    2.94s 
 90.000%    3.43s 
 99.000%    3.83s 
 99.900%    4.02s 
 99.990%    4.11s 
 99.999%    4.16s 
100.000%    4.16s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.208     0.000000            1         1.00
     169.343     0.100000        57767         1.11
     528.895     0.200000       115587         1.25
     836.607     0.300000       173334         1.43
    1358.847     0.400000       231037         1.67
    1915.903     0.500000       288817         2.00
    2109.439     0.550000       317982         2.22
    2340.863     0.600000       346789         2.50
    2525.183     0.650000       375431         2.86
    2727.935     0.700000       404362         3.33
    2942.975     0.750000       433236         4.00
    3028.991     0.775000       447633         4.44
    3108.863     0.800000       462227         5.00
    3188.735     0.825000       476769         5.71
    3266.559     0.850000       490988         6.67
    3344.383     0.875000       505559         8.00
    3387.391     0.887500       512848         8.89
    3430.399     0.900000       520013        10.00
    3475.455     0.912500       527095        11.43
    3524.607     0.925000       534460        13.33
    3567.615     0.937500       541524        16.00
    3594.239     0.943750       545177        17.78
    3620.863     0.950000       548801        20.00
    3645.439     0.956250       552365        22.86
    3672.063     0.962500       555913        26.67
    3704.831     0.968750       559718        32.00
    3719.167     0.971875       561338        35.56
    3735.551     0.975000       563374        40.00
    3749.887     0.978125       564977        45.71
    3768.319     0.981250       566884        53.33
    3786.751     0.984375       568714        64.00
    3794.943     0.985938       569478        71.11
    3807.231     0.987500       570433        80.00
    3823.615     0.989062       571360        91.43
    3839.999     0.990625       572234       106.67
    3856.383     0.992188       573083       128.00
    3866.623     0.992969       573619       142.22
    3874.815     0.993750       574001       160.00
    3885.055     0.994531       574419       182.86
    3899.391     0.995313       574900       213.33
    3921.919     0.996094       575340       256.00
    3932.159     0.996484       575562       284.44
    3942.399     0.996875       575802       320.00
    3952.639     0.997266       576005       365.71
    3971.071     0.997656       576213       426.67
    3989.503     0.998047       576459       512.00
    3995.647     0.998242       576567       568.89
    4001.791     0.998437       576663       640.00
    4012.031     0.998633       576797       731.43
    4018.175     0.998828       576903       853.33
    4024.319     0.999023       577031      1024.00
    4028.415     0.999121       577073      1137.78
    4032.511     0.999219       577130      1280.00
    4036.607     0.999316       577178      1462.86
    4040.703     0.999414       577228      1706.67
    4048.895     0.999512       577295      2048.00
    4052.991     0.999561       577313      2275.56
    4067.327     0.999609       577349      2560.00
    4071.423     0.999658       577368      2925.71
    4075.519     0.999707       577399      3413.33
    4081.663     0.999756       577429      4096.00
    4083.711     0.999780       577439      4551.11
    4087.807     0.999805       577456      5120.00
    4089.855     0.999829       577472      5851.43
    4093.951     0.999854       577481      6826.67
    4102.143     0.999878       577499      8192.00
    4106.239     0.999890       577506      9102.22
    4112.383     0.999902       577511     10240.00
    4122.623     0.999915       577516     11702.86
    4132.863     0.999927       577524     13653.33
    4136.959     0.999939       577533     16384.00
    4139.007     0.999945       577537     18204.44
    4139.007     0.999951       577537     20480.00
    4141.055     0.999957       577542     23405.71
    4143.103     0.999963       577545     27306.67
    4147.199     0.999969       577548     32768.00
    4151.295     0.999973       577552     36408.89
    4151.295     0.999976       577552     40960.00
    4153.343     0.999979       577555     46811.43
    4153.343     0.999982       577555     54613.33
    4155.391     0.999985       577559     65536.00
    4155.391     0.999986       577559     72817.78
    4155.391     0.999988       577559     81920.00
    4155.391     0.999989       577559     93622.86
    4157.439     0.999991       577563    109226.67
    4157.439     0.999992       577563    131072.00
    4157.439     0.999993       577563    145635.56
    4157.439     0.999994       577563    163840.00
    4157.439     0.999995       577563    187245.71
    4157.439     0.999995       577563    218453.33
    4157.439     0.999996       577563    262144.00
    4159.487     0.999997       577565    291271.11
    4159.487     1.000000       577565          inf
#[Mean    =     1824.644, StdDeviation   =     1208.902]
#[Max     =     4157.440, Total count    =       577565]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  702738 requests in 1.00m, 46.43MB read
  Non-2xx or 3xx responses: 349775
Requests/sec:  11712.31
Transfer/sec:    792.39KB